Documents/ЛБ_ОтменаРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ОтменаРКО</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_РасчетыСКлиентами</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ДвиженияДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЛБ_ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ДвиженияДенежныхСредств</Name>
			<Comment>Денежные средства по назначению платежа</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийПКО</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийРКО</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДУЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КорпоративныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Comment>Ломбард</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Comment>Вид денежных средств</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДвиженияДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДвиженияДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацииКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КассоваяОперация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыДвиженияДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДвиженияДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_ОтменаРКО/Ext/ObjectModule.bsl
// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.РКО) Тогда 
			ТекстСообщения = "Не выбран отменяемый расходный кассовый ордер!";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения );
			Отказ = Истина;  
		ИначеЕсли ЭтотОбъект.РКО.Дата >	ЭтотОбъект.Дата Тогда
			ТекстСообщения = "Дата отменяемого расходного кассового ордера " + Формат(ЭтотОбъект.РКО.Дата, "ДЛФ=DT") + " больше дата документа отмены " + Формат(ЭтотОбъект.Дата, "ДЛФ=DT") +  "!";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения );
			Отказ = Истина;  
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборЗаписей = РегистрыНакопления.ЛБ_ДенежныеСредства.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(РКО);
	НаборЗаписей.Прочитать();  
	
	Движения.ЛБ_ДенежныеСредства.Записывать = Истина; 
	Для каждого Запись Из НаборЗаписей Цикл   
		Движение = Движения.ЛБ_ДенежныеСредства.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Запись.Организация;
		Движение.ВидДенежныхСредств = Запись.ВидДенежныхСредств;
		Движение.Ломбард = Запись.Ломбард;	
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сумма = -Запись.Сумма;
	КонецЦикла;	
	
	НаборЗаписей = РегистрыНакопления.ЛБ_ДвиженияДенежныхСредств.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(РКО);
	НаборЗаписей.Прочитать(); 

	Движения.ЛБ_ДвиженияДенежныхСредств.Записывать = Истина;
	Для каждого Запись Из НаборЗаписей Цикл				
		Движение = Движения.ЛБ_ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;  
		Движение.Номер = Запись.Номер;
		Движение.Организация = Запись.Организация;
		Движение.ВидДенежныхСредств = Запись.ВидДенежныхСредств;
		Движение.Ломбард = Запись.Ломбард;	
		Движение.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Расход; 
		Движение.КассоваяОперация = Запись.КассоваяОперация;
		СтруктураКС = ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(Дата, Организация, Ломбард);
		Если НЕ СтруктураКС = неопределено Тогда
		    Движение.КассоваяСмена = СтруктураКС.КассоваяСмена; 
		КонецЕсли;	
		Движение.Сумма = -Запись.Сумма; 
		Движение.БанковскаяКарта = Запись.БанковскаяКарта;
		Движение.ВидОперации = Запись.ВидОперации;
		Движение.ДополнительнаяИнформация = Запись.ДополнительнаяИнформация;
		Движение.Дт = Запись.Дт;
		Движение.Кт = Запись.Кт;
		Движение.ДУЛ = Запись.ДУЛ;
		Движение.Контрагент = Запись.Контрагент;
		Движение.Основание = Запись.Основание;
		Движение.ФизическоеЛицо = Запись.ФизическоеЛицо;
		Движение.ФИО = Запись.ФИО;
	КонецЦикла;   
	
	//НаборЗаписей = РегистрыНакопления.ЛБ_РасчетыСКлиентами.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Регистратор.Установить(РКО);
	//НаборЗаписей.Прочитать(); 
	//
	//Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
	//Для каждого Запись Из НаборЗаписей Цикл		
	//    Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
	//	Движение.Период = Дата;
	//	Движение.Организация = Организация;   
	//	Движение.ВидДвижения = Запись.ВидДвижения;
	//	Движение.Клиент = Запись.Клиент;    
	//    Движение.ВидРасчета = Запись.ВидДвижения;
	//	Движение.ДатаНачалаРасчета = Запись.ДатаНачалаРасчета;
	//	Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет;
	//	Движение.Сумма = -Запись.Сумма;
	//КонецЦикла
КонецПроцедуры
